{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [{"id": 0, "content": "<|endoftext|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 1, "content": "<|im_start|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}, {"id": 2, "content": "<|im_end|>", "single_word": false, "lstrip": false, "rstrip": false, "normalized": false, "special": true}], "normalizer": null, "pre_tokenizer": {"type": "ByteLevel", "add_prefix_space": false, "trim_offsets": true, "use_regex": true}, "post_processor": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": false, "use_regex": true}, "decoder": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": true, "use_regex": true}, "model": {"type": "BPE", "vocab": {"<|endoftext|>": 0, "<|im_start|>": 1, "<|im_end|>": 2, "a": 97, "b": 98, "ab": 99, "<t_3>": 3, "<t_4>": 4, "<t_5>": 5, "<t_6>": 6, "<t_7>": 7, "<t_8>": 8, "<t_9>": 9}, "merges": ["a b"]}}