{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "model_type": "qwen3",
  "hidden_size": 1024,
  "intermediate_size": 3072,
  "num_hidden_layers": 5,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "head_dim": 128,
  "rms_norm_eps": 1e-06,
  "vocab_size": 30720,
  "rope_theta": 1000000.0,
  "use_cache": true,
  "tie_word_embeddings": false,
  "hidden_act": "silu",
  "max_position_embeddings": 32768
}