{"version": "1.0", "truncation": null, "padding": null, "added_tokens": [], "normalizer": null, "pre_tokenizer": {"type": "ByteLevel", "add_prefix_space": false, "trim_offsets": true, "use_regex": true}, "post_processor": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": false, "use_regex": true}, "decoder": {"type": "ByteLevel", "add_prefix_space": true, "trim_offsets": true, "use_regex": true}, "model": {"type": "BPE", "vocab": {"a": 0, "b": 1, "ab": 2, "<t_3>": 3, "<t_4>": 4, "<t_5>": 5, "<t_6>": 6, "<t_7>": 7, "<t_8>": 8, "<t_9>": 9}, "merges": ["a b"]}}